
nc: 10  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 



backbone:
  # [from, repeats, module, args]    640
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2   320
  - [-1, 1, LFC, [128, 3, 2]] # 1-P2/4   160
  - [-1, 3, C2f, [128, True]]   #2       160
  - [-1, 1, LFC, [256, 3, 2]] # 3-P3/8    80
  - [-1, 6, C2f, [256, True]]  #4          80
  - [-1, 1, LFC, [512, 3, 2]] # 5-P4/16   40
  - [-1, 6, RFEB, [512, True]]  #6         40   
  - [-1, 1, LFC, [1024, 3, 2]] # 7-P5/32   20
  - [-1, 3, RFEB, [1024, True]]  #8       20  
  - [-1, 1, SPPF, [1024, 5]] # 9            20

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 40 10
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4  11
  - [-1, 3, HFAB, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     #80
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, HFAB, [256]] # 15 (P3/8-small)    80*80

  - [-1, 1, Conv, [256, 3, 2]]             #40
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, HFAB, [512]] # 18 (P4/16-medium)   40 40

  - [-1, 1, Conv, [512, 3, 2]]            #20
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, HFAB, [1024]] # 21 (P5/32-large)    20 20

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)